Infineon/AURIX_code_examples/code_examples/iLLD_TC375_ADS_SCR_UART/Libraries/Infra/Sfr/TC37x/IfxGeth_bf.h
/** \brief Mask for Ifx_GETH_RWK_FILTER_COMMAND_0_Bits.Filter2_Command */
#define IFX_GETH_RWK_FILTER_COMMAND_0_FILTER2_COMMAND_MSK (0xfu)

/** \brief Offset for Ifx_GETH_RWK_FILTER_COMMAND_0_Bits.Filter2_Command */
#define IFX_GETH_RWK_FILTER_COMMAND_0_FILTER2_COMMAND_OFF (16u)

/** \brief Length for Ifx_GETH_RWK_FILTER_COMMAND_0_Bits.Filter3_Command */
#define IFX_GETH_RWK_FILTER_COMMAND_0_FILTER3_COMMAND_LEN (4u)

/** \brief Mask for Ifx_GETH_RWK_FILTER_COMMAND_0_Bits.Filter3_Command */
#define IFX_GETH_RWK_FILTER_COMMAND_0_FILTER3_COMMAND_MSK (0xfu)

/** \brief Offset for Ifx_GETH_RWK_FILTER_COMMAND_0_Bits.Filter3_Command */
#define IFX_GETH_RWK_FILTER_COMMAND_0_FILTER3_COMMAND_OFF (24u)

/** \brief Length for Ifx_GETH_RWK_FILTER_OFFSET_0_Bits.Filter0_Offset */
#define IFX_GETH_RWK_FILTER_OFFSET_0_FILTER0_OFFSET_LEN (8u)

/** \brief Mask for Ifx_GETH_RWK_FILTER_OFFSET_0_Bits.Filter0_Offset */
#define IFX_GETH_RWK_FILTER_OFFSET_0_FILTER0_OFFSET_MSK (0xffu)

/** \brief Offset for Ifx_GETH_RWK_FILTER_OFFSET_0_Bits.Filter0_Offset */
#define IFX_GETH_RWK_FILTER_OFFSET_0_FILTER0_OFFSET_OFF (0u)

/** \brief Length for Ifx_GETH_RWK_FILTER_OFFSET_0_Bits.Filter1_Offset */
#define IFX_GETH_RWK_FILTER_OFFSET_0_FILTER1_OFFSET_LEN (8u)

/** \brief Mask for Ifx_GETH_RWK_FILTER_OFFSET_0_Bits.Filter1_Offset */
#define IFX_GETH_RWK_FILTER_OFFSET_0_FILTER1_OFFSET_MSK (0xffu)

/** \brief Offset for Ifx_GETH_RWK_FILTER_OFFSET_0_Bits.Filter1_Offset */
#define IFX_GETH_RWK_FILTER_OFFSET_0_FILTER1_OFFSET_OFF (8u)

/** \brief Length for Ifx_GETH_RWK_FILTER_OFFSET_0_Bits.Filter2_Offset */
#define IFX_GETH_RWK_FILTER_OFFSET_0_FILTER2_OFFSET_LEN (8u)

/** \brief Mask for Ifx_GETH_RWK_FILTER_OFFSET_0_Bits.Filter2_Offset */
#define IFX_GETH_RWK_FILTER_OFFSET_0_FILTER2_OFFSET_MSK (0xffu)

/** \brief Offset for Ifx_GETH_RWK_FILTER_OFFSET_0_Bits.Filter2_Offset */
#define IFX_GETH_RWK_FILTER_OFFSET_0_FILTER2_OFFSET_OFF (16u)

/** \brief Length for Ifx_GETH_RWK_FILTER_OFFSET_0_Bits.Filter3_Offset */
#define IFX_GETH_RWK_FILTER_OFFSET_0_FILTER3_OFFSET_LEN (8u)

/** \brief Mask for Ifx_GETH_RWK_FILTER_OFFSET_0_Bits.Filter3_Offset */
#define IFX_GETH_RWK_FILTER_OFFSET_0_FILTER3_OFFSET_MSK (0xffu)

/** \brief Offset for Ifx_GETH_RWK_FILTER_OFFSET_0_Bits.Filter3_Offset */
#define IFX_GETH_RWK_FILTER_OFFSET_0_FILTER3_OFFSET_OFF (24u)

/** \brief Length for Ifx_GETH_RWK_FILTER_CRC_Bits.Filter0_CRC */
#define IFX_GETH_RWK_FILTER_CRC_FILTER0_CRC_LEN (16u)

/** \brief Mask for Ifx_GETH_RWK_FILTER_CRC_Bits.Filter0_CRC */
#define IFX_GETH_RWK_FILTER_CRC_FILTER0_CRC_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_RWK_FILTER_CRC_Bits.Filter0_CRC */
#define IFX_GETH_RWK_FILTER_CRC_FILTER0_CRC_OFF (0u)

/** \brief Length for Ifx_GETH_RWK_FILTER_CRC_Bits.Filter1_CRC */
#define IFX_GETH_RWK_FILTER_CRC_FILTER1_CRC_LEN (16u)

/** \brief Mask for Ifx_GETH_RWK_FILTER_CRC_Bits.Filter1_CRC */
#define IFX_GETH_RWK_FILTER_CRC_FILTER1_CRC_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_RWK_FILTER_CRC_Bits.Filter1_CRC */
#define IFX_GETH_RWK_FILTER_CRC_FILTER1_CRC_OFF (16u)

/** \brief Length for Ifx_GETH_RWK_FILTER_BYTE_MASK_Bits.Filteri_Byte_Mask */
#define IFX_GETH_RWK_FILTER_BYTE_MASK_FILTERI_BYTE_MASK_LEN (32u)

/** \brief Mask for Ifx_GETH_RWK_FILTER_BYTE_MASK_Bits.Filteri_Byte_Mask */
#define IFX_GETH_RWK_FILTER_BYTE_MASK_FILTERI_BYTE_MASK_MSK (0xffffffffu)

/** \brief Offset for Ifx_GETH_RWK_FILTER_BYTE_MASK_Bits.Filteri_Byte_Mask */
#define IFX_GETH_RWK_FILTER_BYTE_MASK_FILTERI_BYTE_MASK_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_LPI_CONTROL_STATUS_Bits.TLPIEN */
#define IFX_GETH_MAC_LPI_CONTROL_STATUS_TLPIEN_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_LPI_CONTROL_STATUS_Bits.TLPIEN */
#define IFX_GETH_MAC_LPI_CONTROL_STATUS_TLPIEN_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_LPI_CONTROL_STATUS_Bits.TLPIEN */
#define IFX_GETH_MAC_LPI_CONTROL_STATUS_TLPIEN_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_LPI_CONTROL_STATUS_Bits.TLPIEX */
#define IFX_GETH_MAC_LPI_CONTROL_STATUS_TLPIEX_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_LPI_CONTROL_STATUS_Bits.TLPIEX */
#define IFX_GETH_MAC_LPI_CONTROL_STATUS_TLPIEX_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_LPI_CONTROL_STATUS_Bits.TLPIEX */
#define IFX_GETH_MAC_LPI_CONTROL_STATUS_TLPIEX_OFF (1u)

/** \brief Length for Ifx_GETH_MAC_LPI_CONTROL_STATUS_Bits.RLPIEN */
#define IFX_GETH_MAC_LPI_CONTROL_STATUS_RLPIEN_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_LPI_CONTROL_STATUS_Bits.RLPIEN */
#define IFX_GETH_MAC_LPI_CONTROL_STATUS_RLPIEN_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_LPI_CONTROL_STATUS_Bits.RLPIEN */
#define IFX_GETH_MAC_LPI_CONTROL_STATUS_RLPIEN_OFF (2u)

/** \brief Length for Ifx_GETH_MAC_LPI_CONTROL_STATUS_Bits.RLPIEX */
#define IFX_GETH_MAC_LPI_CONTROL_STATUS_RLPIEX_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_LPI_CONTROL_STATUS_Bits.RLPIEX */
#define IFX_GETH_MAC_LPI_CONTROL_STATUS_RLPIEX_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_LPI_CONTROL_STATUS_Bits.RLPIEX */
#define IFX_GETH_MAC_LPI_CONTROL_STATUS_RLPIEX_OFF (3u)

/** \brief Length for Ifx_GETH_MAC_LPI_CONTROL_STATUS_Bits.TLPIST */
#define IFX_GETH_MAC_LPI_CONTROL_STATUS_TLPIST_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_LPI_CONTROL_STATUS_Bits.TLPIST */
#define IFX_GETH_MAC_LPI_CONTROL_STATUS_TLPIST_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_LPI_CONTROL_STATUS_Bits.TLPIST */
#define IFX_GETH_MAC_LPI_CONTROL_STATUS_TLPIST_OFF (8u)

/** \brief Length for Ifx_GETH_MAC_LPI_CONTROL_STATUS_Bits.RLPIST */
#define IFX_GETH_MAC_LPI_CONTROL_STATUS_RLPIST_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_LPI_CONTROL_STATUS_Bits.RLPIST */
#define IFX_GETH_MAC_LPI_CONTROL_STATUS_RLPIST_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_LPI_CONTROL_STATUS_Bits.RLPIST */
#define IFX_GETH_MAC_LPI_CONTROL_STATUS_RLPIST_OFF (9u)

/** \brief Length for Ifx_GETH_MAC_LPI_CONTROL_STATUS_Bits.LPIEN */
#define IFX_GETH_MAC_LPI_CONTROL_STATUS_LPIEN_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_LPI_CONTROL_STATUS_Bits.LPIEN */
#define IFX_GETH_MAC_LPI_CONTROL_STATUS_LPIEN_MSK (0x1u)

