Infineon/AURIX_code_examples/code_examples/iLLD_TC375_ADS_SCR_UART/Libraries/Infra/Sfr/TC37x/IfxGeth_bf.h
/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXGOCTIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXGOCTIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXGOCTIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXGOCTIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXGOCTIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXGOCTIS_OFF (20u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXGPKTIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXGPKTIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXGPKTIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXGPKTIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXGPKTIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXGPKTIS_OFF (21u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXEXDEFPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXEXDEFPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXEXDEFPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXEXDEFPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXEXDEFPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXEXDEFPIS_OFF (22u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXPAUSPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXPAUSPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXPAUSPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXPAUSPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXPAUSPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXPAUSPIS_OFF (23u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXVLANGPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXVLANGPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXVLANGPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXVLANGPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXVLANGPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXVLANGPIS_OFF (24u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXOSIZEGPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXOSIZEGPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXOSIZEGPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXOSIZEGPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXOSIZEGPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXOSIZEGPIS_OFF (25u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXLPIUSCIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXLPIUSCIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXLPIUSCIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXLPIUSCIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXLPIUSCIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXLPIUSCIS_OFF (26u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXLPITRCIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXLPITRCIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXLPITRCIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXLPITRCIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXLPITRCIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXLPITRCIS_OFF (27u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXGBPKTIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXGBPKTIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXGBPKTIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXGBPKTIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXGBPKTIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXGBPKTIM_OFF (0u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXGBOCTIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXGBOCTIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXGBOCTIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXGBOCTIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXGBOCTIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXGBOCTIM_OFF (1u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXGOCTIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXGOCTIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXGOCTIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXGOCTIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXGOCTIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXGOCTIM_OFF (2u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXBCGPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXBCGPIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXBCGPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXBCGPIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXBCGPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXBCGPIM_OFF (3u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXMCGPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXMCGPIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXMCGPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXMCGPIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXMCGPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXMCGPIM_OFF (4u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXCRCERPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXCRCERPIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXCRCERPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXCRCERPIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXCRCERPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXCRCERPIM_OFF (5u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXALGNERPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXALGNERPIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXALGNERPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXALGNERPIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXALGNERPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXALGNERPIM_OFF (6u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXRUNTPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXRUNTPIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXRUNTPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXRUNTPIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXRUNTPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXRUNTPIM_OFF (7u)

