Infineon/AURIX_code_examples/code_examples/iLLD_TC375_ADS_SCR_UART/Libraries/Infra/Sfr/TC37x/IfxGeth_bf.h
/** \brief Offset for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXIPV6GPIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXIPV6GPIM_OFF (5u)

/** \brief Length for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXIPV6HERPIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXIPV6HERPIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXIPV6HERPIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXIPV6HERPIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXIPV6HERPIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXIPV6HERPIM_OFF (6u)

/** \brief Length for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXIPV6NOPAYPIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXIPV6NOPAYPIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXIPV6NOPAYPIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXIPV6NOPAYPIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXIPV6NOPAYPIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXIPV6NOPAYPIM_OFF (7u)

/** \brief Length for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXUDPGPIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXUDPGPIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXUDPGPIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXUDPGPIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXUDPGPIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXUDPGPIM_OFF (8u)

/** \brief Length for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXUDPERPIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXUDPERPIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXUDPERPIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXUDPERPIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXUDPERPIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXUDPERPIM_OFF (9u)

/** \brief Length for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXTCPGPIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXTCPGPIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXTCPGPIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXTCPGPIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXTCPGPIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXTCPGPIM_OFF (10u)

/** \brief Length for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXTCPERPIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXTCPERPIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXTCPERPIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXTCPERPIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXTCPERPIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXTCPERPIM_OFF (11u)

/** \brief Length for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXICMPGPIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXICMPGPIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXICMPGPIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXICMPGPIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXICMPGPIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXICMPGPIM_OFF (12u)

/** \brief Length for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXICMPERPIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXICMPERPIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXICMPERPIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXICMPERPIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXICMPERPIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXICMPERPIM_OFF (13u)

/** \brief Length for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXIPV4GOIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXIPV4GOIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXIPV4GOIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXIPV4GOIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXIPV4GOIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXIPV4GOIM_OFF (16u)

/** \brief Length for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXIPV4HEROIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXIPV4HEROIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXIPV4HEROIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXIPV4HEROIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXIPV4HEROIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXIPV4HEROIM_OFF (17u)

/** \brief Length for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXIPV4NOPAYOIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXIPV4NOPAYOIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXIPV4NOPAYOIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXIPV4NOPAYOIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXIPV4NOPAYOIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXIPV4NOPAYOIM_OFF (18u)

/** \brief Length for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXIPV4FRAGOIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXIPV4FRAGOIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXIPV4FRAGOIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXIPV4FRAGOIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXIPV4FRAGOIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXIPV4FRAGOIM_OFF (19u)

/** \brief Length for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXIPV4UDSBLOIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXIPV4UDSBLOIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXIPV4UDSBLOIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXIPV4UDSBLOIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXIPV4UDSBLOIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXIPV4UDSBLOIM_OFF (20u)

/** \brief Length for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXIPV6GOIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXIPV6GOIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXIPV6GOIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXIPV6GOIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXIPV6GOIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXIPV6GOIM_OFF (21u)

/** \brief Length for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXIPV6HEROIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXIPV6HEROIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXIPV6HEROIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXIPV6HEROIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXIPV6HEROIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXIPV6HEROIM_OFF (22u)

