Infineon/AURIX_code_examples/code_examples/iLLD_TC375_ADS_SCR_UART/Libraries/Infra/Sfr/TC37x/IfxGeth_bf.h
/** \brief Offset for Ifx_GETH_MTL_INTERRUPT_STATUS_Bits.Q0IS */
#define IFX_GETH_MTL_INTERRUPT_STATUS_Q0IS_OFF (0u)

/** \brief Length for Ifx_GETH_MTL_INTERRUPT_STATUS_Bits.Q1IS */
#define IFX_GETH_MTL_INTERRUPT_STATUS_Q1IS_LEN (1u)

/** \brief Mask for Ifx_GETH_MTL_INTERRUPT_STATUS_Bits.Q1IS */
#define IFX_GETH_MTL_INTERRUPT_STATUS_Q1IS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MTL_INTERRUPT_STATUS_Bits.Q1IS */
#define IFX_GETH_MTL_INTERRUPT_STATUS_Q1IS_OFF (1u)

/** \brief Length for Ifx_GETH_MTL_INTERRUPT_STATUS_Bits.Q2IS */
#define IFX_GETH_MTL_INTERRUPT_STATUS_Q2IS_LEN (1u)

/** \brief Mask for Ifx_GETH_MTL_INTERRUPT_STATUS_Bits.Q2IS */
#define IFX_GETH_MTL_INTERRUPT_STATUS_Q2IS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MTL_INTERRUPT_STATUS_Bits.Q2IS */
#define IFX_GETH_MTL_INTERRUPT_STATUS_Q2IS_OFF (2u)

/** \brief Length for Ifx_GETH_MTL_INTERRUPT_STATUS_Bits.Q3IS */
#define IFX_GETH_MTL_INTERRUPT_STATUS_Q3IS_LEN (1u)

/** \brief Mask for Ifx_GETH_MTL_INTERRUPT_STATUS_Bits.Q3IS */
#define IFX_GETH_MTL_INTERRUPT_STATUS_Q3IS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MTL_INTERRUPT_STATUS_Bits.Q3IS */
#define IFX_GETH_MTL_INTERRUPT_STATUS_Q3IS_OFF (3u)

/** \brief Length for Ifx_GETH_MTL_RXQ_DMA_MAP0_Bits.Q0MDMACH */
#define IFX_GETH_MTL_RXQ_DMA_MAP0_Q0MDMACH_LEN (2u)

/** \brief Mask for Ifx_GETH_MTL_RXQ_DMA_MAP0_Bits.Q0MDMACH */
#define IFX_GETH_MTL_RXQ_DMA_MAP0_Q0MDMACH_MSK (0x3u)

/** \brief Offset for Ifx_GETH_MTL_RXQ_DMA_MAP0_Bits.Q0MDMACH */
#define IFX_GETH_MTL_RXQ_DMA_MAP0_Q0MDMACH_OFF (0u)

/** \brief Length for Ifx_GETH_MTL_RXQ_DMA_MAP0_Bits.Q0DDMACH */
#define IFX_GETH_MTL_RXQ_DMA_MAP0_Q0DDMACH_LEN (1u)

/** \brief Mask for Ifx_GETH_MTL_RXQ_DMA_MAP0_Bits.Q0DDMACH */
#define IFX_GETH_MTL_RXQ_DMA_MAP0_Q0DDMACH_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MTL_RXQ_DMA_MAP0_Bits.Q0DDMACH */
#define IFX_GETH_MTL_RXQ_DMA_MAP0_Q0DDMACH_OFF (4u)

/** \brief Length for Ifx_GETH_MTL_RXQ_DMA_MAP0_Bits.Q1MDMACH */
#define IFX_GETH_MTL_RXQ_DMA_MAP0_Q1MDMACH_LEN (2u)

/** \brief Mask for Ifx_GETH_MTL_RXQ_DMA_MAP0_Bits.Q1MDMACH */
#define IFX_GETH_MTL_RXQ_DMA_MAP0_Q1MDMACH_MSK (0x3u)

/** \brief Offset for Ifx_GETH_MTL_RXQ_DMA_MAP0_Bits.Q1MDMACH */
#define IFX_GETH_MTL_RXQ_DMA_MAP0_Q1MDMACH_OFF (8u)

/** \brief Length for Ifx_GETH_MTL_RXQ_DMA_MAP0_Bits.Q1DDMACH */
#define IFX_GETH_MTL_RXQ_DMA_MAP0_Q1DDMACH_LEN (1u)

/** \brief Mask for Ifx_GETH_MTL_RXQ_DMA_MAP0_Bits.Q1DDMACH */
#define IFX_GETH_MTL_RXQ_DMA_MAP0_Q1DDMACH_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MTL_RXQ_DMA_MAP0_Bits.Q1DDMACH */
#define IFX_GETH_MTL_RXQ_DMA_MAP0_Q1DDMACH_OFF (12u)

/** \brief Length for Ifx_GETH_MTL_RXQ_DMA_MAP0_Bits.Q2MDMACH */
#define IFX_GETH_MTL_RXQ_DMA_MAP0_Q2MDMACH_LEN (2u)

/** \brief Mask for Ifx_GETH_MTL_RXQ_DMA_MAP0_Bits.Q2MDMACH */
#define IFX_GETH_MTL_RXQ_DMA_MAP0_Q2MDMACH_MSK (0x3u)

/** \brief Offset for Ifx_GETH_MTL_RXQ_DMA_MAP0_Bits.Q2MDMACH */
#define IFX_GETH_MTL_RXQ_DMA_MAP0_Q2MDMACH_OFF (16u)

/** \brief Length for Ifx_GETH_MTL_RXQ_DMA_MAP0_Bits.Q2DDMACH */
#define IFX_GETH_MTL_RXQ_DMA_MAP0_Q2DDMACH_LEN (1u)

/** \brief Mask for Ifx_GETH_MTL_RXQ_DMA_MAP0_Bits.Q2DDMACH */
#define IFX_GETH_MTL_RXQ_DMA_MAP0_Q2DDMACH_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MTL_RXQ_DMA_MAP0_Bits.Q2DDMACH */
#define IFX_GETH_MTL_RXQ_DMA_MAP0_Q2DDMACH_OFF (20u)

/** \brief Length for Ifx_GETH_MTL_RXQ_DMA_MAP0_Bits.Q3MDMACH */
#define IFX_GETH_MTL_RXQ_DMA_MAP0_Q3MDMACH_LEN (2u)

/** \brief Mask for Ifx_GETH_MTL_RXQ_DMA_MAP0_Bits.Q3MDMACH */
#define IFX_GETH_MTL_RXQ_DMA_MAP0_Q3MDMACH_MSK (0x3u)

/** \brief Offset for Ifx_GETH_MTL_RXQ_DMA_MAP0_Bits.Q3MDMACH */
#define IFX_GETH_MTL_RXQ_DMA_MAP0_Q3MDMACH_OFF (24u)

/** \brief Length for Ifx_GETH_MTL_RXQ_DMA_MAP0_Bits.Q3DDMACH */
#define IFX_GETH_MTL_RXQ_DMA_MAP0_Q3DDMACH_LEN (1u)

/** \brief Mask for Ifx_GETH_MTL_RXQ_DMA_MAP0_Bits.Q3DDMACH */
#define IFX_GETH_MTL_RXQ_DMA_MAP0_Q3DDMACH_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MTL_RXQ_DMA_MAP0_Bits.Q3DDMACH */
#define IFX_GETH_MTL_RXQ_DMA_MAP0_Q3DDMACH_OFF (28u)

/** \brief Length for Ifx_GETH_MTL_TXQ0_OPERATION_MODE_Bits.FTQ */
#define IFX_GETH_MTL_TXQ0_OPERATION_MODE_FTQ_LEN (1u)

/** \brief Mask for Ifx_GETH_MTL_TXQ0_OPERATION_MODE_Bits.FTQ */
#define IFX_GETH_MTL_TXQ0_OPERATION_MODE_FTQ_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MTL_TXQ0_OPERATION_MODE_Bits.FTQ */
#define IFX_GETH_MTL_TXQ0_OPERATION_MODE_FTQ_OFF (0u)

/** \brief Length for Ifx_GETH_MTL_TXQ0_OPERATION_MODE_Bits.TSF */
#define IFX_GETH_MTL_TXQ0_OPERATION_MODE_TSF_LEN (1u)

/** \brief Mask for Ifx_GETH_MTL_TXQ0_OPERATION_MODE_Bits.TSF */
#define IFX_GETH_MTL_TXQ0_OPERATION_MODE_TSF_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MTL_TXQ0_OPERATION_MODE_Bits.TSF */
#define IFX_GETH_MTL_TXQ0_OPERATION_MODE_TSF_OFF (1u)

/** \brief Length for Ifx_GETH_MTL_TXQ0_OPERATION_MODE_Bits.TXQEN */
#define IFX_GETH_MTL_TXQ0_OPERATION_MODE_TXQEN_LEN (2u)

/** \brief Mask for Ifx_GETH_MTL_TXQ0_OPERATION_MODE_Bits.TXQEN */
#define IFX_GETH_MTL_TXQ0_OPERATION_MODE_TXQEN_MSK (0x3u)

/** \brief Offset for Ifx_GETH_MTL_TXQ0_OPERATION_MODE_Bits.TXQEN */
#define IFX_GETH_MTL_TXQ0_OPERATION_MODE_TXQEN_OFF (2u)

/** \brief Length for Ifx_GETH_MTL_TXQ0_OPERATION_MODE_Bits.TTC */
#define IFX_GETH_MTL_TXQ0_OPERATION_MODE_TTC_LEN (3u)

/** \brief Mask for Ifx_GETH_MTL_TXQ0_OPERATION_MODE_Bits.TTC */
#define IFX_GETH_MTL_TXQ0_OPERATION_MODE_TTC_MSK (0x7u)

/** \brief Offset for Ifx_GETH_MTL_TXQ0_OPERATION_MODE_Bits.TTC */
#define IFX_GETH_MTL_TXQ0_OPERATION_MODE_TTC_OFF (4u)

/** \brief Length for Ifx_GETH_MTL_TXQ0_OPERATION_MODE_Bits.TQS */
#define IFX_GETH_MTL_TXQ0_OPERATION_MODE_TQS_LEN (4u)

/** \brief Mask for Ifx_GETH_MTL_TXQ0_OPERATION_MODE_Bits.TQS */
#define IFX_GETH_MTL_TXQ0_OPERATION_MODE_TQS_MSK (0xfu)

/** \brief Offset for Ifx_GETH_MTL_TXQ0_OPERATION_MODE_Bits.TQS */
#define IFX_GETH_MTL_TXQ0_OPERATION_MODE_TQS_OFF (16u)

/** \brief Length for Ifx_GETH_MTL_TXQ0_UNDERFLOW_Bits.UFFRMCNT */
#define IFX_GETH_MTL_TXQ0_UNDERFLOW_UFFRMCNT_LEN (11u)

/** \brief Mask for Ifx_GETH_MTL_TXQ0_UNDERFLOW_Bits.UFFRMCNT */
#define IFX_GETH_MTL_TXQ0_UNDERFLOW_UFFRMCNT_MSK (0x7ffu)

