Infineon/AURIX_code_examples/code_examples/iLLD_TC375_ADS_SCR_UART/Libraries/Infra/Sfr/TC37x/IfxGeth_bf.h
/** \brief Offset for Ifx_GETH_DMA_CH_STATUS_Bits.REB */
#define IFX_GETH_DMA_CH_STATUS_REB_OFF (19u)

/** \brief Length for Ifx_GETH_DMA_CH_MISS_FRAME_CNT_Bits.MFC */
#define IFX_GETH_DMA_CH_MISS_FRAME_CNT_MFC_LEN (11u)

/** \brief Mask for Ifx_GETH_DMA_CH_MISS_FRAME_CNT_Bits.MFC */
#define IFX_GETH_DMA_CH_MISS_FRAME_CNT_MFC_MSK (0x7ffu)

/** \brief Offset for Ifx_GETH_DMA_CH_MISS_FRAME_CNT_Bits.MFC */
#define IFX_GETH_DMA_CH_MISS_FRAME_CNT_MFC_OFF (0u)

/** \brief Length for Ifx_GETH_DMA_CH_MISS_FRAME_CNT_Bits.MFCO */
#define IFX_GETH_DMA_CH_MISS_FRAME_CNT_MFCO_LEN (1u)

/** \brief Mask for Ifx_GETH_DMA_CH_MISS_FRAME_CNT_Bits.MFCO */
#define IFX_GETH_DMA_CH_MISS_FRAME_CNT_MFCO_MSK (0x1u)

/** \brief Offset for Ifx_GETH_DMA_CH_MISS_FRAME_CNT_Bits.MFCO */
#define IFX_GETH_DMA_CH_MISS_FRAME_CNT_MFCO_OFF (15u)

/** \brief Length for Ifx_GETH_CLC_Bits.DISR */
#define IFX_GETH_CLC_DISR_LEN (1u)

/** \brief Mask for Ifx_GETH_CLC_Bits.DISR */
#define IFX_GETH_CLC_DISR_MSK (0x1u)

/** \brief Offset for Ifx_GETH_CLC_Bits.DISR */
#define IFX_GETH_CLC_DISR_OFF (0u)

/** \brief Length for Ifx_GETH_CLC_Bits.DISS */
#define IFX_GETH_CLC_DISS_LEN (1u)

/** \brief Mask for Ifx_GETH_CLC_Bits.DISS */
#define IFX_GETH_CLC_DISS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_CLC_Bits.DISS */
#define IFX_GETH_CLC_DISS_OFF (1u)

/** \brief Length for Ifx_GETH_ID_Bits.MODREV */
#define IFX_GETH_ID_MODREV_LEN (8u)

/** \brief Mask for Ifx_GETH_ID_Bits.MODREV */
#define IFX_GETH_ID_MODREV_MSK (0xffu)

/** \brief Offset for Ifx_GETH_ID_Bits.MODREV */
#define IFX_GETH_ID_MODREV_OFF (0u)

/** \brief Length for Ifx_GETH_ID_Bits.MODTYPE */
#define IFX_GETH_ID_MODTYPE_LEN (8u)

/** \brief Mask for Ifx_GETH_ID_Bits.MODTYPE */
#define IFX_GETH_ID_MODTYPE_MSK (0xffu)

/** \brief Offset for Ifx_GETH_ID_Bits.MODTYPE */
#define IFX_GETH_ID_MODTYPE_OFF (8u)

/** \brief Length for Ifx_GETH_ID_Bits.MODNUM */
#define IFX_GETH_ID_MODNUM_LEN (16u)

/** \brief Mask for Ifx_GETH_ID_Bits.MODNUM */
#define IFX_GETH_ID_MODNUM_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_ID_Bits.MODNUM */
#define IFX_GETH_ID_MODNUM_OFF (16u)

/** \brief Length for Ifx_GETH_GPCTL_Bits.ALTI0 */
#define IFX_GETH_GPCTL_ALTI0_LEN (2u)

/** \brief Mask for Ifx_GETH_GPCTL_Bits.ALTI0 */
#define IFX_GETH_GPCTL_ALTI0_MSK (0x3u)

/** \brief Offset for Ifx_GETH_GPCTL_Bits.ALTI0 */
#define IFX_GETH_GPCTL_ALTI0_OFF (0u)

/** \brief Length for Ifx_GETH_GPCTL_Bits.ALTI1 */
#define IFX_GETH_GPCTL_ALTI1_LEN (2u)

/** \brief Mask for Ifx_GETH_GPCTL_Bits.ALTI1 */
#define IFX_GETH_GPCTL_ALTI1_MSK (0x3u)

/** \brief Offset for Ifx_GETH_GPCTL_Bits.ALTI1 */
#define IFX_GETH_GPCTL_ALTI1_OFF (2u)

/** \brief Length for Ifx_GETH_GPCTL_Bits.ALTI2 */
#define IFX_GETH_GPCTL_ALTI2_LEN (2u)

/** \brief Mask for Ifx_GETH_GPCTL_Bits.ALTI2 */
#define IFX_GETH_GPCTL_ALTI2_MSK (0x3u)

/** \brief Offset for Ifx_GETH_GPCTL_Bits.ALTI2 */
#define IFX_GETH_GPCTL_ALTI2_OFF (4u)

/** \brief Length for Ifx_GETH_GPCTL_Bits.ALTI3 */
#define IFX_GETH_GPCTL_ALTI3_LEN (2u)

/** \brief Mask for Ifx_GETH_GPCTL_Bits.ALTI3 */
#define IFX_GETH_GPCTL_ALTI3_MSK (0x3u)

/** \brief Offset for Ifx_GETH_GPCTL_Bits.ALTI3 */
#define IFX_GETH_GPCTL_ALTI3_OFF (6u)

/** \brief Length for Ifx_GETH_GPCTL_Bits.ALTI4 */
#define IFX_GETH_GPCTL_ALTI4_LEN (2u)

/** \brief Mask for Ifx_GETH_GPCTL_Bits.ALTI4 */
#define IFX_GETH_GPCTL_ALTI4_MSK (0x3u)

/** \brief Offset for Ifx_GETH_GPCTL_Bits.ALTI4 */
#define IFX_GETH_GPCTL_ALTI4_OFF (8u)

/** \brief Length for Ifx_GETH_GPCTL_Bits.ALTI5 */
#define IFX_GETH_GPCTL_ALTI5_LEN (2u)

/** \brief Mask for Ifx_GETH_GPCTL_Bits.ALTI5 */
#define IFX_GETH_GPCTL_ALTI5_MSK (0x3u)

/** \brief Offset for Ifx_GETH_GPCTL_Bits.ALTI5 */
#define IFX_GETH_GPCTL_ALTI5_OFF (10u)

/** \brief Length for Ifx_GETH_GPCTL_Bits.ALTI6 */
#define IFX_GETH_GPCTL_ALTI6_LEN (2u)

/** \brief Mask for Ifx_GETH_GPCTL_Bits.ALTI6 */
#define IFX_GETH_GPCTL_ALTI6_MSK (0x3u)

/** \brief Offset for Ifx_GETH_GPCTL_Bits.ALTI6 */
#define IFX_GETH_GPCTL_ALTI6_OFF (12u)

/** \brief Length for Ifx_GETH_GPCTL_Bits.ALTI7 */
#define IFX_GETH_GPCTL_ALTI7_LEN (2u)

/** \brief Mask for Ifx_GETH_GPCTL_Bits.ALTI7 */
#define IFX_GETH_GPCTL_ALTI7_MSK (0x3u)

/** \brief Offset for Ifx_GETH_GPCTL_Bits.ALTI7 */
#define IFX_GETH_GPCTL_ALTI7_OFF (14u)

/** \brief Length for Ifx_GETH_GPCTL_Bits.ALTI8 */
#define IFX_GETH_GPCTL_ALTI8_LEN (2u)

/** \brief Mask for Ifx_GETH_GPCTL_Bits.ALTI8 */
#define IFX_GETH_GPCTL_ALTI8_MSK (0x3u)

/** \brief Offset for Ifx_GETH_GPCTL_Bits.ALTI8 */
#define IFX_GETH_GPCTL_ALTI8_OFF (16u)

/** \brief Length for Ifx_GETH_GPCTL_Bits.ALTI9 */
#define IFX_GETH_GPCTL_ALTI9_LEN (2u)

/** \brief Mask for Ifx_GETH_GPCTL_Bits.ALTI9 */
#define IFX_GETH_GPCTL_ALTI9_MSK (0x3u)

/** \brief Offset for Ifx_GETH_GPCTL_Bits.ALTI9 */
#define IFX_GETH_GPCTL_ALTI9_OFF (18u)

/** \brief Length for Ifx_GETH_GPCTL_Bits.ALTI10 */
#define IFX_GETH_GPCTL_ALTI10_LEN (2u)

/** \brief Mask for Ifx_GETH_GPCTL_Bits.ALTI10 */
#define IFX_GETH_GPCTL_ALTI10_MSK (0x3u)

/** \brief Offset for Ifx_GETH_GPCTL_Bits.ALTI10 */
#define IFX_GETH_GPCTL_ALTI10_OFF (20u)

/** \brief Length for Ifx_GETH_GPCTL_Bits.EPR */
#define IFX_GETH_GPCTL_EPR_LEN (3u)

/** \brief Mask for Ifx_GETH_GPCTL_Bits.EPR */
#define IFX_GETH_GPCTL_EPR_MSK (0x7u)

/** \brief Offset for Ifx_GETH_GPCTL_Bits.EPR */
#define IFX_GETH_GPCTL_EPR_OFF (22u)

/** \brief Length for Ifx_GETH_ACCEN0_Bits.EN0 */
#define IFX_GETH_ACCEN0_EN0_LEN (1u)

/** \brief Mask for Ifx_GETH_ACCEN0_Bits.EN0 */
#define IFX_GETH_ACCEN0_EN0_MSK (0x1u)

/** \brief Offset for Ifx_GETH_ACCEN0_Bits.EN0 */
#define IFX_GETH_ACCEN0_EN0_OFF (0u)

/** \brief Length for Ifx_GETH_ACCEN0_Bits.EN1 */
#define IFX_GETH_ACCEN0_EN1_LEN (1u)

/** \brief Mask for Ifx_GETH_ACCEN0_Bits.EN1 */
#define IFX_GETH_ACCEN0_EN1_MSK (0x1u)

/** \brief Offset for Ifx_GETH_ACCEN0_Bits.EN1 */
#define IFX_GETH_ACCEN0_EN1_OFF (1u)

/** \brief Length for Ifx_GETH_ACCEN0_Bits.EN2 */
#define IFX_GETH_ACCEN0_EN2_LEN (1u)

/** \brief Mask for Ifx_GETH_ACCEN0_Bits.EN2 */
#define IFX_GETH_ACCEN0_EN2_MSK (0x1u)

/** \brief Offset for Ifx_GETH_ACCEN0_Bits.EN2 */
#define IFX_GETH_ACCEN0_EN2_OFF (2u)

