Infineon/AURIX_code_examples/code_examples/iLLD_TC375_ADS_SCR_UART/Libraries/Infra/Sfr/TC37x/IfxGeth_bf.h
/** \brief Length for Ifx_GETH_ACCEN0_Bits.EN27 */
#define IFX_GETH_ACCEN0_EN27_LEN (1u)

/** \brief Mask for Ifx_GETH_ACCEN0_Bits.EN27 */
#define IFX_GETH_ACCEN0_EN27_MSK (0x1u)

/** \brief Offset for Ifx_GETH_ACCEN0_Bits.EN27 */
#define IFX_GETH_ACCEN0_EN27_OFF (27u)

/** \brief Length for Ifx_GETH_ACCEN0_Bits.EN28 */
#define IFX_GETH_ACCEN0_EN28_LEN (1u)

/** \brief Mask for Ifx_GETH_ACCEN0_Bits.EN28 */
#define IFX_GETH_ACCEN0_EN28_MSK (0x1u)

/** \brief Offset for Ifx_GETH_ACCEN0_Bits.EN28 */
#define IFX_GETH_ACCEN0_EN28_OFF (28u)

/** \brief Length for Ifx_GETH_ACCEN0_Bits.EN29 */
#define IFX_GETH_ACCEN0_EN29_LEN (1u)

/** \brief Mask for Ifx_GETH_ACCEN0_Bits.EN29 */
#define IFX_GETH_ACCEN0_EN29_MSK (0x1u)

/** \brief Offset for Ifx_GETH_ACCEN0_Bits.EN29 */
#define IFX_GETH_ACCEN0_EN29_OFF (29u)

/** \brief Length for Ifx_GETH_ACCEN0_Bits.EN30 */
#define IFX_GETH_ACCEN0_EN30_LEN (1u)

/** \brief Mask for Ifx_GETH_ACCEN0_Bits.EN30 */
#define IFX_GETH_ACCEN0_EN30_MSK (0x1u)

/** \brief Offset for Ifx_GETH_ACCEN0_Bits.EN30 */
#define IFX_GETH_ACCEN0_EN30_OFF (30u)

/** \brief Length for Ifx_GETH_ACCEN0_Bits.EN31 */
#define IFX_GETH_ACCEN0_EN31_LEN (1u)

/** \brief Mask for Ifx_GETH_ACCEN0_Bits.EN31 */
#define IFX_GETH_ACCEN0_EN31_MSK (0x1u)

/** \brief Offset for Ifx_GETH_ACCEN0_Bits.EN31 */
#define IFX_GETH_ACCEN0_EN31_OFF (31u)

/** \brief Length for Ifx_GETH_KRST0_Bits.RST */
#define IFX_GETH_KRST0_RST_LEN (1u)

/** \brief Mask for Ifx_GETH_KRST0_Bits.RST */
#define IFX_GETH_KRST0_RST_MSK (0x1u)

/** \brief Offset for Ifx_GETH_KRST0_Bits.RST */
#define IFX_GETH_KRST0_RST_OFF (0u)

/** \brief Length for Ifx_GETH_KRST0_Bits.RSTSTAT */
#define IFX_GETH_KRST0_RSTSTAT_LEN (1u)

/** \brief Mask for Ifx_GETH_KRST0_Bits.RSTSTAT */
#define IFX_GETH_KRST0_RSTSTAT_MSK (0x1u)

/** \brief Offset for Ifx_GETH_KRST0_Bits.RSTSTAT */
#define IFX_GETH_KRST0_RSTSTAT_OFF (1u)

/** \brief Length for Ifx_GETH_KRST1_Bits.RST */
#define IFX_GETH_KRST1_RST_LEN (1u)

/** \brief Mask for Ifx_GETH_KRST1_Bits.RST */
#define IFX_GETH_KRST1_RST_MSK (0x1u)

/** \brief Offset for Ifx_GETH_KRST1_Bits.RST */
#define IFX_GETH_KRST1_RST_OFF (0u)

/** \brief Length for Ifx_GETH_KRSTCLR_Bits.CLR */
#define IFX_GETH_KRSTCLR_CLR_LEN (1u)

/** \brief Mask for Ifx_GETH_KRSTCLR_Bits.CLR */
#define IFX_GETH_KRSTCLR_CLR_MSK (0x1u)

/** \brief Offset for Ifx_GETH_KRSTCLR_Bits.CLR */
#define IFX_GETH_KRSTCLR_CLR_OFF (0u)

/** \brief Length for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN0 */
#define IFX_GETH_ACCEND_ACCEN0D_EN0_LEN (1u)

/** \brief Mask for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN0 */
#define IFX_GETH_ACCEND_ACCEN0D_EN0_MSK (0x1u)

/** \brief Offset for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN0 */
#define IFX_GETH_ACCEND_ACCEN0D_EN0_OFF (0u)

/** \brief Length for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN1 */
#define IFX_GETH_ACCEND_ACCEN0D_EN1_LEN (1u)

/** \brief Mask for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN1 */
#define IFX_GETH_ACCEND_ACCEN0D_EN1_MSK (0x1u)

/** \brief Offset for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN1 */
#define IFX_GETH_ACCEND_ACCEN0D_EN1_OFF (1u)

/** \brief Length for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN2 */
#define IFX_GETH_ACCEND_ACCEN0D_EN2_LEN (1u)

/** \brief Mask for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN2 */
#define IFX_GETH_ACCEND_ACCEN0D_EN2_MSK (0x1u)

/** \brief Offset for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN2 */
#define IFX_GETH_ACCEND_ACCEN0D_EN2_OFF (2u)

/** \brief Length for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN3 */
#define IFX_GETH_ACCEND_ACCEN0D_EN3_LEN (1u)

/** \brief Mask for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN3 */
#define IFX_GETH_ACCEND_ACCEN0D_EN3_MSK (0x1u)

/** \brief Offset for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN3 */
#define IFX_GETH_ACCEND_ACCEN0D_EN3_OFF (3u)

/** \brief Length for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN4 */
#define IFX_GETH_ACCEND_ACCEN0D_EN4_LEN (1u)

/** \brief Mask for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN4 */
#define IFX_GETH_ACCEND_ACCEN0D_EN4_MSK (0x1u)

/** \brief Offset for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN4 */
#define IFX_GETH_ACCEND_ACCEN0D_EN4_OFF (4u)

/** \brief Length for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN5 */
#define IFX_GETH_ACCEND_ACCEN0D_EN5_LEN (1u)

/** \brief Mask for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN5 */
#define IFX_GETH_ACCEND_ACCEN0D_EN5_MSK (0x1u)

/** \brief Offset for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN5 */
#define IFX_GETH_ACCEND_ACCEN0D_EN5_OFF (5u)

/** \brief Length for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN6 */
#define IFX_GETH_ACCEND_ACCEN0D_EN6_LEN (1u)

/** \brief Mask for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN6 */
#define IFX_GETH_ACCEND_ACCEN0D_EN6_MSK (0x1u)

/** \brief Offset for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN6 */
#define IFX_GETH_ACCEND_ACCEN0D_EN6_OFF (6u)

/** \brief Length for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN7 */
#define IFX_GETH_ACCEND_ACCEN0D_EN7_LEN (1u)

/** \brief Mask for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN7 */
#define IFX_GETH_ACCEND_ACCEN0D_EN7_MSK (0x1u)

/** \brief Offset for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN7 */
#define IFX_GETH_ACCEND_ACCEN0D_EN7_OFF (7u)

/** \brief Length for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN8 */
#define IFX_GETH_ACCEND_ACCEN0D_EN8_LEN (1u)

/** \brief Mask for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN8 */
#define IFX_GETH_ACCEND_ACCEN0D_EN8_MSK (0x1u)

/** \brief Offset for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN8 */
#define IFX_GETH_ACCEND_ACCEN0D_EN8_OFF (8u)

/** \brief Length for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN9 */
#define IFX_GETH_ACCEND_ACCEN0D_EN9_LEN (1u)

/** \brief Mask for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN9 */
#define IFX_GETH_ACCEND_ACCEN0D_EN9_MSK (0x1u)

/** \brief Offset for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN9 */
#define IFX_GETH_ACCEND_ACCEN0D_EN9_OFF (9u)

/** \brief Length for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN10 */
#define IFX_GETH_ACCEND_ACCEN0D_EN10_LEN (1u)

/** \brief Mask for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN10 */
#define IFX_GETH_ACCEND_ACCEN0D_EN10_MSK (0x1u)

/** \brief Offset for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN10 */
#define IFX_GETH_ACCEND_ACCEN0D_EN10_OFF (10u)

/** \brief Length for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN11 */
#define IFX_GETH_ACCEND_ACCEN0D_EN11_LEN (1u)

/** \brief Mask for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN11 */
#define IFX_GETH_ACCEND_ACCEN0D_EN11_MSK (0x1u)

/** \brief Offset for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN11 */
#define IFX_GETH_ACCEND_ACCEN0D_EN11_OFF (11u)

/** \brief Length for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN12 */
#define IFX_GETH_ACCEND_ACCEN0D_EN12_LEN (1u)

/** \brief Mask for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN12 */
#define IFX_GETH_ACCEND_ACCEN0D_EN12_MSK (0x1u)

